/*//Задание 1
var a = +prompt("Задание 1. Введите сторону квадрата", "");
if(a != 0 && a!= NaN) {
	alert("Площадь квадрата = " + a + "^2 = " + a * a);
}

//Задание 2
var s	= +prompt("Задание 2. Введите Расстояние между автомобилями",	"100");
var v1	= +prompt("Задание 2. Введите скорость первого автомобиля",		"5");
var v2	= +prompt("Задание 2. Введите скорость второго автомобиля",		"5");
var t	= +prompt("Задание 2. Введите время движения",					"10");
alert("Расстояние между автомобилями составило: " + Math.abs(s - (v1 + v2) * t));

//Задание 3
//Для единообразия кодя я "забуду", что переменная а уже существует.
var a = +prompt("Задание 3. Ax^2 + Bx + C = 0. Введите A",	"1");
var b = +prompt("Задание 3. Ax^2 + Bx + C = 0. Введите B",	"2");
var c = +prompt("Задание 3. Ax^2 + Bx + C = 0. Введите C",	"1");
var d = b * b - 4 * a * c;
var x1, x2;

if(d < 0) {
	alert("Уравнение не имеет решения в поле действительных чисел");
} else {
	x1 = (-b + Math.sqrt(d)) / (2 * a);
	x2 = (-b - Math.sqrt(d)) / (2 * a);
	
	if(x1 == x2) {
		alert("x = " + x1);
	} else {
		alert("x1 = " + x1 + " x2 = " + x2);
	}
}

//Задание 4
var a = prompt("Задание 4. Введите число", "0");
if(a > 0) {
	a += 1;
} else if (a < 0) {
	a -= 2;
} else {
	a = 10;
}
alert("Я тут подумал, что вам больше подойдёт число " + a);

//Задание 5
var a = +prompt("Задание 5. Введите A",	"1");
var b = +prompt("Задание 5. Введите B",	"2");
var c = +prompt("Задание 5. Введите C",	"1");
var res;

if(a > b){
	if(c > b){	//b - min
		res = a + c;
	} else {	//c - min
		res = a + b;
	}
} else			//a <= b
{
	if(c > a){	//a - min
		res = b + c;
	} else {	//c - min
		res = a + b;
	}
}

alert("Из чисел [" + a + "; " + b + "; " + c + "] сумма двух наибольших = " + res);

//Задание 6
var a = +prompt("Задание 6. Введите что-нибудь",	"");
var res;

if(a == 0){
	res = "Нулевое число";
} else {
	res = "Число ";
	if(a > 0){
		res += "положительное ";
	} else {
		res += "отрицательное ";
	}
	if(a % 2 == 0){
		res += "чётное";
	} else {
		res += "нечётное";
	}
}

alert(res);

//Задание 7
var a = +prompt("Задание 7. Введите A",	"1");
var b = +prompt("Задание 7. Введите B",	"2");

alert(	"A = " + a +
		";\nB = " + b + ";\n" +
		(a > 2 && b <= 3 ? "С" : "Не с") +
		"правделивы неравенства A > 2 и B ≤ 3");

//Задание 8
var a = +prompt("Задание 8. Введите A",	"1");
var b = +prompt("Задание 8. Введите B",	"2");
var c = +prompt("Задание 8. Введите С",	"3");

alert(	"A = " + a +
		";\nB = " + b +
		";\nC = " + c + "\n" +
		(a < b && b < c ? "С" : "Не с") +
		"правделиво неравенство A < B < C");
		
//Задание 9
var a = +prompt("Задание 9. Введите A",	"1");
var b = +prompt("Задание 9. Введите B",	"2");
var c = +prompt("Задание 9. Введите C",	"1");
var d = +prompt("Задание 9. Введите D",	"1");
var num;

if(b == a){
	if(b == c){
		num = 4;
	} else {
		num = 3;
	} 	
} else {
	if(a == c){
		num = 2;
	} else {
		num = 1;
	}
}
alert("Задание 9. Из чисел [" + a + "; " + b + "; " + c + "; " + d + "] Отличается число №" + num);
*/

//Задание 10
var mark = +prompt("Задание 9. Введите оценку",	"1");
var res;
switch(mark){
	case 5:
		res = "отлично";
		break;
	case 4:
		res = "хорошо";
		break;
	case 3:
		res = "удоволетворительно";
		break;
	case 2:
		res = "неудоволетворительно";
		break;
	case 1:
		res = "плохо";
		break;
	default:
		res = "ошибка";
}
alert("Оценка \"" + mark + "\" это " + res);